Repository: mariyam-190/FloraFi-Apple-Academy-NC2
Catalog: FloraFi/Localizable.xcstrings
Source language: en
Languages: ar

# التسميد
source: Fertilization
ar: التسميد

# السقي
source: Watering
ar: السقي

# بعد نموها لمدة تتراوح بين 3 إلى 4 أسابيع
source: After growing for 3 to 4 weeks
ar: بعد نموها لمدة تتراوح بين 3 إلى 4 أسابيع

# تتحمل درجات الحرارة العالية
source: Withstands high temperatures
ar: تتحمل درجات الحرارة العالية

# تتراوح بين 8 إلى 10 أسابيع من الزراعة
source: Ranging between 8 to 10 weeks from planting
ar: تتراوح بين 8 إلى 10 أسابيع من الزراعة

source: It is called a Vinca rosea, and it is a beautiful perennial plant. It produces dense, attractive leaves and is covered with abundant flowers that bloom during the summer and resemble summer phlox. It tolerates drought and extreme heat
ar: تُسمّى الونكة وهي نبتة معمرة خلابة. تُنتج أوراقًا كثيفة، جذّابة ومغطّاة بأزهار غزيرة تتفتّح خلال فصل الصيف وتشبه الفلوكس الصيفيّ. تتحمل الجفاف والحرارةالشديدة

# ري منتظم ليبقى الجذور رطبة.
source: Regular watering to keep the roots moist.
ar: ري منتظم ليبقى الجذور رطبة.

# طوال السنة،يفضل في الخريف وبداية الربيع
source: All year round, preferably in fall and early spring
ar: طوال السنة،يفضل في الخريف وبداية الربيع

# لا تتحمل درجات الحرارة العالية
source: It does not tolerate high Temperatures
ar: لا تتحمل درجات الحرارة العالية

# لاتتحمل درجات الحرارة العالية
source: It does not tolerate high Temperatures
ar: لاتتحمل درجات الحرارة العالية

source: A fast-growing ink plant, roots appear from the nodes spread on the stem that contribute to stabilizing it. Hence its importance as a plant that stabilizes the soil from erosion and tolerates high temperatures.
ar: نبات مداد وسريع النمو وتظهر من العقد المنتشرة على الساق جذور تساهم في تثبيته ومن هنا تأتي أهميته كنبات مثبت للتربة من الانجراف يتحمل درجات الحرارة العالية

source: Tomatoes are considered a seasonal plant, grown in the winter or in temperate climates, and are harvested 60 days after planting the seeds, fertilizing and pruning.
ar: يعتبر الطماطم من النباتات الموسمية ، التي يتم زراعتها في فصل الشتاء او في الاجواء المعتدلة ، ويتم الحصاد بعد ٦٠ يوم من زرع البذور والتسميد والتقليم

source: Many plants can be grown in the winter (October to full), and the plants are seasonal, dying after the season ends.
ar: يمكن زراعة الكثير من النباتات في فصل الشتاء (أكتوبر الى ابريل)، ومعظم النباتات تكون موسميّة ، تموت بعد انتهاء الموسم .

# أواخر شهر مارس وأوائل شهر أبريل.
source: Late March and early April.
ar: أواخر شهر مارس وأوائل شهر أبريل.

# اختر الفصل
source: Choose Season
ar: اختر الفصل

# اختر الموسم
source: Choose Season
ar: اختر الموسم

# اختر منطقتك
source: Choose Area
ar: اختر منطقتك

# اكاسيا
source: Cassia glauca
ar: اكاسيا جلوكا

# اكاسيا جلوكا
source: Cassia glauca
ar: اكاسيا جلوكا

# اكاسيا جلوكا Cassia glauc
source: Cassia glauca
ar: اكاسيا جلوكا

# البامية
source: Okra
ar: البامية

# البقدونس
source: Parsley
ar: البقدونس

# التزهير
source: Flowering
ar: التزهير

# الجو المعتدل
source: Moderate Weather
ar: الجو المعتدل

# الجو المعتدل/لا تتحمل درجات الحرارة العالية
source: Moderate climate/cannot tolerate high temperatures
ar: الجو المعتدل/لا تتحمل درجات الحرارة العالية

# الخلف
source: Back
ar: الخلف

# الريحان
source: Basil
ar: الريحان

# الشتاء
source: Winter
ar: الشتاء

# الصيف
source: Summer
ar: الصيف

# الطماطم
source: Tomato
ar: الطماطم

# الكزبرة
source: Coriander
ar: الكزبرة

# المزيد
source: More
ar: المزيد

# المفضلة
source: Favorite
ar: المفضلة

# الملوخية
source: Molokhiya
ar: الملوخية

# المواسم
source: Seasons
ar: المواسم

# النباتات
source: Plants
ar: النباتات

# النباتات
source: The Plants
ar: النباتات

# النباتات الشتوية
source: Winter Plants
ar: النباتات الشتوية

# النباتات الصيفية
source: Summer Plants
ar: النباتات الصيفية

# النباتات تعيش طوال العام
source: Plants live all year round
ar: النباتات تعيش طوال العام

# الونكا
source: Vinca rosea
ar: الونكا-بفتة

# الونكا-بفتة
source: Vinca rosea
ar: الونكا-بفتة

# اواخر الربيع ، بداية الصيف
source: Late spring, early summer
ar: اواخر الربيع ، بداية الصيف

# بانتظام بمعدل كل 4-6 أسابيع للمحافظة على الشكل
source: Regularly, every 4-6 weeks to maintain shape
ar: بانتظام بمعدل كل 4-6 أسابيع للمحافظة على الشكل

# بانتظام بمعدل كل 4-6 أسابيع للمحافظة على شكل النبات
source: Regularly, every 4-6 weeks to maintain shape
ar: بانتظام بمعدل كل 4-6 أسابيع للمحافظة على شكل النبات

# بانتظام كل 4 إلى 6 أسابيع للحفاظ على نموه الصحي
source: Regularly every 4 to 6 weeks to maintain healthy growth
ar: بانتظام بمعدل كل 4-6 أسابيع للمحافظة على شكل النبات

# بذرة الست
source: Buthrat Alst
ar: بذرة الست

# بقدونس
source: Parsley
ar: بقدونس

# تتحمل درجات الحرارة العالية والشمس المباشرة
source: It tolerates high temperatures and direct sun
ar: تتحمل درجات الحرارة العالية والشمس المباشرة

# تحتاج اللي الشمس الكاملة من أجل أن تنتج أزهار ملونة
source: It needs full sun in order to produce colorful flowers
ar: تحتاج اللي الشمس الكاملة من أجل أن تنتج أزهار ملونة

# تحصد الثمرة بعد ٦٠ يوم من وضع البذور
source: The fruit is harvested 60 days after sowing the seeds
ar: تحصد الثمرة بعد ٦٠ يوم من وضع البذور

# تحصد الثمرة من ٤٥ -٧٠ يوم من وضع البذور
source: The fruit is harvested 60 days after sowing the seeds
ar: تحصد الثمرة من ٤٥ -٧٠ يوم من وضع البذور

# تقليم الأوراق المريضة الذابلة مرة واحدة في الشهر.
source: Trim wilted, diseased leaves once a month.
ar: تقليم الأوراق المريضة الذابلة مرة واحدة في الشهر.

# تقليم الجزء العلوي عندما يتراوح ارتفاعها ما بين 1.5 إلى 1.8 م تقريباً
source: Trim the top when its height ranges between approximately 1.5 to 1.8 m
ar: تقليم الجزء العلوي عندما يتراوح ارتفاعها ما بين 1.5 إلى 1.8 م تقريباً

# تقليم الشتلة مراراً، وذلك بإزالة الزهور الميتة كل فترة
source: Prune the seedling repeatedly, by removing dead flowers every now and then
ar: تقليم الشتلة مراراً، وذلك بإزالة الزهور الميتة كل فترة

# درجة الحرارة
source: Temperature
ar: درجة الحرارة

source: Growing okra is a simple process and can be done in gardens or pots. It needs direct sunlight and can tolerate high temperatures. It is preferable to plant it in soil rich in organic matter and well-drained.
ar: زراعة البامية هي عملية بسيطة ويمكن إجراؤها في الحدائق أو الأواني. تحتاج الى أشعة شمس مياشرة وتتحمل درجات الحرارة العالية يفضل زراعتها في تربة غنية بالمواد العضوية وجيدة التصريف

source: Growing parsley is a simple process and can be done in gardens or ponds. It is preferable to plant it in soil rich in organic matter and well-drained.
ar: زراعة البقدونس هي عملية بسيطة ويمكن إجراؤها في الحدائق أو الأحواض , يُفضل زراعته في تربة غنية بالمواد العضوية وجيدة التصريف

# زراعة الريحان
source: Basil cultivation
ar: زراعة الريحان

# زراعة الطماطم
source: Tomato cultivation
ar: زراعه الطماطم

# زراعة الكزبرة
source: Coriander cultivation
ar: زراعة الكزبرة

source: Growing coriander is a simple process and can be done in home gardens or pots. It requires moderate sunlight. It is preferable to plant mint in soil rich in organic matter and well-drained.
ar: زراعة الكزبرة هي عملية بسيطة ويمكن إجراؤها في الحدائق المنزلية أو الأواني تحتاج الى أشعة شمس معتدلة يُفضل زراعة النعناع في تربة غنية بالمواد العضوية وجيدة التصريف

# زراعة الملوخية
source: Molokhia cultivation
ar: زراعة الملوخية

source: Growing molokhia is a simple process and can be done in home gardens or ponds through seeds. It tolerates high temperatures and is preferred to be planted in soil rich in organic matter and well-drained.
ar: زراعة الملوخية هي عملية بسيطة ويمكن إجراؤها في الحدائق المنزلية أو الأحواض عن طريق البذور.تتحمل درجات الحرارة العالية يُفضل زراعتها في تربة غنية بالمواد العضوية وجيدة التصريف

# زراعة النعناع
source: Mint cultivation
ar: زراعة النعناع

source: Growing mint is a simple process and can be done in home gardens or ponds. It needs moderate sunlight. It is preferable to grow mint in soil rich in organic matter and well-drained.
ar: زراعة النعناع هي عملية بسيطة ويمكن إجراؤها في الحدائق المنزلية أو الأحواض.تحتاج الى أشعة شمس معتدلة يُفضل زراعة النعناع في تربة غنية بالمواد العضوية وجيدة التصريف

# زراعه الطماطم
source: Tomato cultivation
ar: زراعه الطماطم

# زهور البتونيا Petunias
source: Petunias
ar: زهور البتونيا

# سماد NPK متوازن ،مرة واحدة كحد أدنى شهريًا
source: Balanced NPK fertilizer, a minimum of once a month
ar: سماد NPK متوازن ،مرة واحدة كحد أدنى شهريًا

# سماد NPK متوازن وينبغي تسميدها مرة واحدة كحد أدنى شهريًا
source: Balanced NPK fertilizer, a minimum of once a month
ar: سماد NPK متوازن وينبغي تسميدها مرة واحدة كحد أدنى شهريًا

# سماد عالي الفسفور مرة واحدة خلال شهر من زراعتها
source: High phosphorus fertilizer once within a month of planting
ar: سماد عالي الفسفور مرة واحدة خلال شهر من زراعتها

# سماد عضوي مثل سماد البقر أو السماد المتحلل
source: Organic fertilizer such as cow manure or decomposed manure
ar: سماد عضوي مثل سماد البقر أو السماد المتحلل

source: The Acacia glauca tree is a flowering tree. The flowers are a very bright yellow color. Flowering often occurs throughout the year, but it is strongest in the spring, summer, and fall seasons.
ar: شجرة اكاسيا جلوكا من الاشجار المزهره الازهار ذات لون اصفر لامع جدا.غالبا ما يتم الازهار علي مدار السنه و لكن يكون بشكل اقوي في فصول الربيع و الصيف و الخريف.

# ضوء الشمس المعتدل لمدة 6-8 ساعات يوميًا.
source: Moderate sunlight for 6-8 hours daily.
ar: ضوء الشمس المعتدل لمدة 6-8 ساعات يوميًا.

# طوال العام
source: All year round
ar: طوال العام

# كل أسبوعين خلال موسم النمو الصيفي
source: Every two weeks during the summer growing season
ar: كل أسبوعين خلال موسم النمو الصيفي

# لا تتحمل درجات الحرارة العالية والشمس المباشرة
source: It does not tolerate high temperatures and direct sun
ar: لا تتحمل درجات الحرارة العالية والشمس المباشرة

# لا يتحمل درجات الحرارة العالية
source: It does not tolerate high temperatures
ar: لا يتحمل درجات الحرارة العالية

# للحصول على التنبيهات
source: To Get Notifications
ar: للحصول على التنبهات

# لمعرفة المزيد
source: Read More
ar: لمعرفة المزيد

# من سبتمبر الى ابريل
source: From September to April
ar: من سبتمبر الى ابريل

# من شهر اكتوبر الى شهر ابريل
source: From October to April
ar: من شهر اكتوبر الى شهر ابريل

# من منتصف شهر فبراير الى منتصف شهر ابريل
source: From mid-February to mid-April
ar: من منتصف شهر فبراير الى منتصف شهر ابريل

# موسمي
source: seasonal
ar: موسمي

source: Plants that live throughout the year and tolerate different temperatures, depending on the seasons, so that they flower and bear fruit according to their life cycle.
ar: نباتات تعيش طوال العام وتتحمل مختلف درجات الحرارة ، باختلاف المواسم بحيث انها تزهر وتثمر حسب دورة حياتها .

source: This season consists of six days in which all types of plants can be planted, and it is from the 7th to the 12th of February every year.
ar: هذا الموسم عبارة عن ست أيام يمكن زراعة كافة انواع النباتات وهي من ٧-١٢ من شهر فبراير فى كل عام.

# يبدأ من شهر أكتوبر الى شهر أبريل
source: It Starts from October to April
ar: يبدأ من شهر أكتوبر الى شهر أبريل

# يبدأ من شهر فبراير الى شهر أبريل
source: It Starts from October to April
ar: يبدأ من شهر أكتوبر الى شهر أبريل

# يبدأ من شهر فبراير الى شهر سبتمبر
source: It starts from February to September
ar: يبدأ من شهر فبراير الى شهر سبتمبر

# يبدأ من شهر فبرايرالى شهر سبتمبر
source: It starts from February to September
ar: يبدأ من شهر فبراير الى شهر سبتمبر

# يتحمل درجات الحرارة العالية
source: Withstands high temperatures
ar: يتحمل درجات الحرارة العالية

source: It is characterized by high temperatures and strong sunlight, which contributes to faster growth of plants. Many plants are grown during it, but it is recommended to plant them in the winter or as seeds.
ar: يتميز بارتفاع درجات الحرارة وتوافر أشعة الشمس القوية، مما يساهم في نمو النباتات بشكل أسرع. يزرع خلالها الكثير من النباتات.ولكن ينصح بغرسها في الشتاء او بذرة الست .

# يحتاج النعناع إلى ري منتظم ليبقى الجذور رطبة.
source: Mint needs regular watering to keep the roots moist.
ar: يحتاج النعناع إلى ري منتظم ليبقى الجذور رطبة.

source: Tomatoes are considered a seasonal plant, grown in the winter or in temperate climates, and are harvested 45-70 days after planting the seeds, fertilizing and pruning.
ar: يعتبر الطماطم من النباتات الموسمية ، التي يتم زراعتها في فصل الشتاء او في الاجواء المعتدلة ، ويتم الحصاد بعد ٤٥-٧٠ يوم من زرع البذوروالتسميد والتقليم

source: The petunia plant is considered one of the beautiful plants with wonderful multi-colored flowers, and therefore many people want to grow it. It is considered a seasonal flower that does not tolerate high temperatures.
ar: يعتبر نبات البيتونيا من النباتات الجميلة ذات الأزهار الرائعة متعددة الألوان، ولذلك يرغب الكثير من الأشخاص بزراعتها ، تعتبر من الزهور الموسمية لاتتحمل درجات الحرارة العالية

source: Basil can be grown in home gardens or in pots and pots. Basil requires a sunny location, well-drained soil, and regular watering. It has a lovely aromatic scent
ar: يمكن زراعة الريحان في الحدائق المنزلية أو في الأصص والأواني. يتطلب الريحان موقعًا مشمسًا وتربة جيدة التصريف وريًا منتظمًا.ويتميز برائحة عطرية جميلة

source: Many fruits, vegetables and flowers can be grown in the summer months (from June to August), which tolerate high temperatures, but it is recommended to plant seedlings or seeds in the winter season.
ar: يمكن زراعة الكثير من الفواكة والخضروات والزهور في أشهر الصيف ( من شهر يونيو الى اغسطس)، والتي تتحمل درجة الحرارة العالية ، ولكن ينصح بغرس الشتلات في موسم الشتاء او بذرة الست ،

source: Many fruits, vegetables and flowers can be grown in the winter (from October to April), and most plants are seasonal and die after the season ends.
ar: يمكن زراعة الكثير من الفواكة والخضروات والزهور في فصل الشتاء ( من شهر أكتوبر الى ابريل)، ومعظم النباتات تكون موسميّة ، تموت بعد انتهاء الموسم

source: Many plants can be grown in the winter (October to April), and most plants are seasonal and die after the season ends.
ar: يمكن زراعة الكثير من النباتات في فصل الشتاء (أكتوبر الى ابريل)، ومعظم النباتات تكون موسميّة ، تموت بعد انتهاء الموسم .

# يمكن زراعتها طوال العام وتتحمل مختلف درجات الحرارة ،
source: It can be grown throughout the year and tolerates various temperatures.
ar: يمكن زراعتها طوال العام وتتحمل مختلف درجات الحرارة ،

source: It can be grown throughout the year and it tolerates various temperatures, depending on seasons and climates, so that it blooms and bears fruit according to its life cycle.
ar: يمكن زراعتها طوال العام وتتحمل مختلف درجات الحرارة ، باختلاف المواسم والاجواء بحيث انها تزهر وتثمر حسب دورة حياتها .
